<template>
    <div class="wrapper">
        <div class="screen">
            <div class="base rules" v-if="page === 'rules'">
                <div class="header">
                    <div class="header-title">Дорожный кодекс штата Сан Андреас</div>
                </div>
                <div class="content-wrapper">
                    <div class="content">
                        <p class="headline">1.Общие положения</p>

                        <p>
                            <b>1.1.</b> Настоящие Правила дорожного движения (В дальнейшем – Правила) устанавливают единый порядок дорожного движения на всей территории Штата Лос Сантос). Другие нормативные акты, касающиеся дорожного движения, должны основываться на требованиях
                            Правил и не противоречить им.
                        </p>
                        <p><b>1.2.</b>В Правилах используются следующие основные понятия и термины:</p>
                        <p><b>"Автопоезд"</b> - механическое транспортное средство, сцепленное с прицепом (прицепами).</p>
                        <p><b>"Водитель"</b> - лицо, управляющее каким-либо транспортным средством.К водителю приравнивается обучающий вождению.</p>
                        <p><b>"Вынужденная остановка"</b> - прекращение движения транспортного средства из-за его технической неисправности или опасности, создаваемой перевозимым грузом, состоянием водителя (пассажира) или появлением препятствия на дороге.</p>
                        <p><b>"Обгон"</b> - опережение одного или нескольких транспортных средств, связанное с выездом на полосу (сторону проезжей части), предназначенную для встречного движения, и последующим возвращением на ранее занимаемую полосу (сторону проезжей части).</p>
                        <p>
                            <b>"Организованная транспортная колонна"</b> - группа из трех и более механических транспортных средств, следующих непосредственно друг за другом по одной и той же полосе движения в сопровождении головного транспортного средства с включенными
                            проблесковыми маячками.
                        </p>
                        <p><b>"Остановка"</b> - преднамеренное прекращение движения транспортного средства на время до 5 минут, а также на большее, если это необходимо для посадки или высадки пассажиров либо загрузки или разгрузки транспортного средства.</p>
                        <p><b>"Парковка (парковочное место)"</b> - специально обозначенное и при необходимости обустроенное и оборудованное место, являющееся, в том числе частью автомобильной дороги и (или) примыкающее к проезжей части и (или) тротуару, обочине, эстакаде</p>
                        <p><b>"Прицеп"</b> - транспортное средство, не оборудованное двигателем и предназначенное для движения в составе с механическим транспортным средством. Термин распространяется также на полуприцепы и прицепы-роспуски.</p>
                        <p><b>"Темное время суток"</b> - промежуток времени от конца вечерних сумерек до начала утренних сумерек.</p>
                        <p><b>"Транспортное средство"</b> - устройство, предназначенное для перевозки по дорогам людей, грузов или оборудования, установленного на нем.</p>
                        <p>
                            <b>"Уступить дорогу (не создавать помех)"</b> - требование, означающее, что участник дорожного движения не должен начинать, возобновлять или продолжать движение, осуществлять какой-либо манёвр, если это может вынудить других участников движения,
                            имеющих по отношению к нему преимущество, изменить направление движения или скорость.
                        </p>
                        <p><b>"Участник дорожного движения"</b> - лицо, принимающее непосредственное участие в процессе движения в качестве водителя, пешехода, пассажира транспортного средства.</p>
                        <p><b>1.3.</b>Участники дорожного движения обязаны знать и соблюдать относящиеся к ним требования Правил, сигналов светофоров, знаков и разметки</p>
                        <p><b>1.4.</b>На дорогах установлено правостороннее движение транспортных средств.</p>
                        <p><b>1.5.</b>Участники дорожного движения должны действовать таким образом, чтобы не создавать опасности для движения и не причинять вреда.</p>
                        <p><b>1.6.</b>Лица, нарушившие Правила, несут ответственность в соответствии с действующим законодательством.</p>

                        <p class="headline">2. Общие обязанности водителей</p>

                        <p><b>2.</b>Водитель механического транспортного средства обязан:</p>
                        <p><b>2.1.</b>Предъявить по требованию сотрудников полиции водительское удостоверение на право управления транспортным средством соответствующей категории.</p>
                        <p><b>2.2.</b>По требованию должностных лиц, уполномоченных на осуществление надзора в области безопасности дорожного движения, проходить освидетельствование на состояние алкогольного и наркотического опьянения.</p>
                        <p><b>2.3.</b>При дорожно-транспортном происшествии водитель, причастный к нему, обязан немедленно остановить (не трогать с места) транспортное средство</p>
                        <p><b>2.4.</b>Водителю запрещается:</p>
                        <p>управлять транспортным средством в состоянии опьянения (алкогольного, наркотического или иного), под воздействием лекарственных препаратов</p>
                        <p>передавать управление транспортным средством лицам, находящимся в состоянии опьянения, под воздействием лекарственных препаратов</p>
                        <p>употреблять алкогольные напитки, наркотические, психотропные или иные одурманивающие вещества после дорожно-транспортного происшествия</p>
                        <p>пользоваться во время движения телефоном</p>
                        <p>
                            опасное вождение, выражающееся в неоднократном совершении одного или совершении нескольких следующих друг за другом действий, заключающихся в невыполнении при перестроении требования уступить дорогу транспортному средству, пользующемуся
                            преимущественным правом движения
                        </p>

                        <p class="headline">3. Применение специальных сигналов</p>

                        <p>
                            <b>3.1.</b> Водители транспортных средств с включенным проблесковым маячком красно-синего цвета, выполняя неотложное служебное задание, могут отступать от требований правил дорожного кодекса для получения преимущества перед другими участниками
                            движения.
                        </p>
                        <p><b>3.2.</b> При приближении транспортного средства с включенными проблесковым маячком красно-синего цвета и специальным звуковым сигналом водители обязаны уступить дорогу для обеспечения беспрепятственного проезда указанного транспортного средства.</p>
                        <p><b> 3.3.</b> Приближаясь к стоящему транспортному средству с включенным проблесковым маячком красно-синего цвета, водитель должен снизить скорость, чтобы иметь возможность немедленно остановиться в случае необходимости.</p>

                        <p class="headline">4. Обязанности пешеходов</p>

                        <p><b>4.1.</b> Пешеходы должны двигаться по тротуарам, пешеходным дорожкам, а при их отсутствии по обочинам.</p>
                        <p><b>4.2.</b> Движение организованных пеших колонн по проезжей части разрешается только по направлению движения транспортных средств по правой стороне не более чем по четыре человека в ряд.</p>
                        <p><b>4.3.</b> Пешеходы должны переходить дорогу по пешеходным переходам, в том числе по подземным и надземным, а при их отсутствии на перекрестках по линии тротуаров или обочин.</p>
                        <p><b>4.4.</b> Пешеход должен убедиться в безопасности пересечения проезжей части посмотрев налево, а затем направо</p>

                        <p class="headline">5. Применение аварийной сигнализации</p>

                        <p><b>5.1.</b> Аварийная сигнализация должна быть включена:</p>
                        <p>при дорожно-транспортном происшествии;</p>
                        <p>при вынужденной остановке в местах, где остановка запрещена;</p>

                        <p class="headline">6. Начало движения, маневрирование</p>

                        <p><b>6.1.</b> Перед началом движения, перестроением, поворотом (разворотом) и остановкой водитель обязан подавать сигналы световыми указателями поворота соответствующего направления.</p>
                        <p><b>6.2.</b> При выезде на дорогу с прилегающей территории водитель должен уступить дорогу транспортным средствам и пешеходам, движущимся по ней.</p>
                        <p><b>6.3.</b> В случаях, когда траектории движения транспортных средств пересекаются, а очередность проезда не оговорена Правилами, дорогу должен уступить водитель, к которому транспортное средство приближается справа.</p>
                        <p><b>6.4.</b> Разворот запрещается:</p>
                        <p>на пешеходных переходах;</p>
                        <p>в тоннелях;</p>
                        <p>на мостах, путепроводах, эстакадах и под ними;</p>
                        <p>на железнодорожных переездах;</p>
                        <p>в местах остановок маршрутных транспортных средств.</p>
                        <p><b>6.5.</b> Движение транспортного средства задним ходом разрешается при условии, что этот манёвр будет безопасен и не создаст помех другим участникам движения.</p>
                        <p>
                            <b>6.6.</b> На дорогах с двусторонним движением, имеющих четыре или более полосы, запрещается выезжать для обгона или объезда на полосу, предназначенную для встречного движения. На таких дорогах повороты налево или развороты могут выполняться на
                            перекрестках и в других местах, где это не запрещено Правилами, знаками и (или) разметкой.
                        </p>
                        <p>
                            <b>6.7.</b> На дорогах с двусторонним движением, имеющих три полосы, обозначенные разметкой из которых средняя используется для движения в обоих направлениях, разрешается выезжать на эту полосу только для обгона, объезда, поворота налево или разворота.
                            Выезжать на крайнюю левую полосу, предназначенную для встречного движения, запрещается.
                        </p>
                        <p><b>6.8</b>. водитель управляющий автопоездом имеет право пренебречь разметкой для вынужденного маневра.</p>

                        <p class="headline">7. Расположение транспортных средств на проезжей части</p>

                        <p><b>7.1.</b> На любых дорогах с двусторонним движением запрещается движение по полосе, предназначенной для встречного движения</p>
                        <p><b>7.2.</b> На дорогах с двусторонним движением, имеющих четыре или более полосы, запрещается выезжать для обгона или объезда на полосу, предназначенную для встречного движения.</p>
                        <p><b>7.3.</b> Транспортные средства, скорость движения которых не должна превышать 40 км/ч или которые по техническим причинам не могут развивать такую скорость, должны двигаться по крайней правой полосе.</p>
                        <p><b>7.4.</b> Запрещается движение транспортных средств по разделительным полосам и обочинам, тротуарам и пешеходным дорожкам.</p>
                        <p><b>7.5.</b> Водитель должен соблюдать такую дистанцию до движущегося впереди транспортного средства, которая позволила бы избежать столкновения, а также необходимый боковой интервал, обеспечивающий безопасность движения.</p>

                        <p class="headline">8. Скорость движения</p>

                        <p>8.1. Водитель должен вести транспортное средство со скоростью, не превышающей установленного ограничения, учитывая при этом интенсивность движения.</p>
                        <p><b>8.2.</b> В населенных пунктах разрешается движение транспортных средств со скоростью не более 60 км/ч</p>
                        <p><b>8.3.</b> Вне населенных пунктов разрешается движение:</p>
                        <p>На автомагистрали мотоциклам, легковым автомобилям и грузовым автомобилям со скоростью не более 160 км/ч, на остальных дорогах не более 90 км/ч;</p>
                        <p>автобусам на всех дорогах не более 90 км/ч;</p>
                        <p><b>8.5.</b> Водителю запрещается:</p>
                        <p>превышать скорость, указанную на опознавательном знаке "Ограничение скорости"</p>
                        <p>создавать помехи другим транспортным средствам, двигаясь без необходимости со слишком малой скоростью;</p>
                        <p>резко тормозить, если это не требуется для предотвращения дорожно-транспортного происшествия.</p>

                        <p class="headline">9. Справляемся с экстренными ситуациями</p>

                        <p>Во время вождения, события могут происходить очень быстро. У Вас может быть только доли секунды для принятия правильного решения. Следуйте этим указаниям при возникновении экстренных ситуаций.</p>

                        <p class="headline">9.1 Поломки</p>

                        <p>По возможности паркуйтесь там где поврежденную машину можно будет увидеть за 100 метров в любом направлении.</p>
                        <p>Уберите машину, чтобы все четыре колеса были вне полосы движения.</p>
                        <p>Включите аварийную сигнализацию</p>
                        <p>Высадите всех пассажиров на обочину подальше от движения. Поднимите капот.</p>

                        <p class="headline">9.1 Парковка</p>

                        <p>Когда Вы паркуетесь на общественной дороге, отодвиньтесь от участников движения как можно дальше. Если на дороге есть обочина, отъезжайте на неё как можно дальше. Если есть бордюр, паркуйтесь как можно ближе к нему.</p>
                        <p>Всегда паркуйтесь на правой стороне дороги за исключением если это дорога с односторонним движением.</p>

                        <p class="headline"><b>10.1.</b> Где парковка не разрешается:</p>

                        <p>На обочине дороги рядом с другой запаркованной машиной (двойная парковка)</p>
                        <p>На пешеходных переходах</p>
                        <p>На тротуарах</p>
                        <p>Перед выездами</p>

                        <p>У бордюров окрашенных:</p>
                        <p>Красный — запрещена и парковка и остановка, кроме автомобилей инкассации и спецтранспорта.</p>
                        <p>Белый — остановка для посадки/высадки пассажиров.</p>
                        <p>Жёлтый — предназначен для кратковременной остановки на указанное на знаке время с целью посадки/высадки людей.</p>
                        <p>Зелёный — паркинг на ограниченное время. Нужно внимательно смотреть на знаки таких бордюров. Там могут указывать, на сколько, времени можно останавливаться и кто может это делать.</p>
                        <p>Синий — место парковки для инвалидов.</p>
                        <p>На перекрёстках</p>
                        <p>На твёрдом покрытии скоростного шоссе, где нет отмеченного парковочного места</p>
                        <p>На любом мосту, эстакаде или тоннеле</p>
                        <p>Если Вы блокируете или создаете угрозу другим машинам</p>

                        <p class="headline">11. Делим дорогу</p>

                        <p><b>11.1.</b> Поворачивающий водитель обязан остановится перед пешеходами на перекрёстке или выезде с прилегающей территории</p>
                        <p><b>11.2.</b> Водитель обязан остановится или пропустить пешеходов пересекающих дорогу или выезд на любом размеченном пересечении, выезде или перекрёстке не оборудованным светофором.</p>
                        <p><b>11.3.</b> Делим дорогу с мотоциклистом:</p>
                        <p>Следите за мотоциклистами и уступайте право проезда.</p>
                        <p>Когда Ваша машина обгоняет мотоцикл, сохраняйте вашу позицию на полосе движения и скорость. Дайте возможность мотоциклисту закончить манёвр и занять надлежащую позицию на полосе.</p>
                        <p>Сохранять 4-х секундную буферную зону между Вами и мотоциклистом, больше в плохую погоду</p>
                        <p><b>11.4.</b> Мопеды</p>
                        <p>Лица едущие на мопедах имеют те же самые права и обязанности, как и водители автомобилей. Водители мопедов нарушающие ПДД получат вызов в суд.</p>
                        <p>Вам должно быть 16 лет или старше для управления мопедом на общественных дорогах.</p>
                        <p><b>11.5.</b> Общественный транспорт</p>
                        <p>Все водители должны уступать право проезда общественному транспорту следующему в том же самом направлении который подаёт сигналы и вливается в поток транспорта из специально обозначенных мест остановки.</p>

                        <p class="headline">12. Проезд перекрестков</p>

                        <p><b>12.1.</b> При повороте направо или налево водитель обязан уступить дорогу пешеходам, пересекающим проезжую часть дороги, на которую он поворачивает.</p>

                        <p><b>12.2.</b> На перекрестке неравнозначных дорог водитель транспортного средства, движущегося по второстепенной дороге, должен уступить дорогу транспортным средствам, приближающимся по главной, независимо от направления их дальнейшего движения.</p>

                        <p><b>12.3</b> При пересечении перекрестка равнозначных дорог, водитель транспортного средства должен уступить дорогу транспортному средству, которое пересекает перекрёсток справой стороны</p>
                    </div>
                </div>
                <div class="footer">
                    <div class="btn" @click="page = 'cards'">Далее</div>
                </div>
            </div>
            <div class="base cards" v-if="page === 'cards'">
                <div class="card" v-for="category in driverCategory">
                    <div class="card-header">Категория {{ category.title }}</div>
                    <div class="card-body" :class="category.imgClass">
                        <div class="card-text">{{ category.description }}</div>
                        <div class="card-price" v-if="license.findIndex(l => l.title === category.title) != -1">{{ category.price * 0.1 }}$</div>
                        <div class="card-price" v-else>{{ category.price }}$</div>
                    </div>
                    <div class="card-footer">
                        <div class="card-btn" @click="updateLicense(category.title, category.price * 0.1)" v-if="license.findIndex(l => l.title === category.title) != -1">
                            Продлить
                        </div>
                        <div class="card-btn" @click="startTest(category.title, category.price, category.buy)" v-else>Получить</div>
                    </div>
                </div>
            </div>
            <div class="base test" v-if="page === 'test'">
                <div class="header">
                    <div class="header-title">Пройдите тест</div>
                </div>
                <div class="content">
                    <div class="test-item" v-for="question in preparedTest">
                        <div class="item-header">{{ question.question }}</div>
                        <form class="item-body">
                            <div class="answer-wrap" v-for="answer in question.answers">
                                <input :type="question.multipleAnswer ? 'checkbox' : 'radio'" :id="'test-' + question.id + '-' + answer.id" name="radio-group" :value="answer.id" v-model="question.selectedAnswer" />
                                <label :for="'test-' + question.id + '-' + answer.id">{{ answer.text }}</label>
                            </div>
                        </form>
                    </div>
                </div>
                <div class="footer">
                    <div class="btn" @click="endTest()">Сдать тест</div>
                </div>
            </div>
            <div class="base result" v-if="page === 'result-success'">
                <div class="header">
                    <div class="header-title">Поздравляем!</div>
                </div>
                <div class="content">
                    <div class="text success">Вы успешно прошли теорию по категории {{ selectedCategory }}, приступайте к практике!</div>
                </div>
                <div class="footer">
                    <div class="btn" @click="exit()">Начать практику</div>
                </div>
            </div>
            <div class="base result" v-if="page === 'result-fail'">
                <div class="header">
                    <div class="header-title">Тест провален!</div>
                </div>
                <div class="content content-fail">
                    <div class="text fail">Тест по теории на категорию {{ selectedCategory }} провален, Вы можете попытаться пройти его ещё раз!</div>
                    <div class="text fail">
                        Вы допустили ошибки в следующих впросах:
                    </div>
                    <div class="mistakes">
                        <div class="text fail small" v-for="mistake in wrongAnswers">
                            {{ mistake }}
                        </div>
                    </div>
                </div>
                <div class="footer">
                    <div class="btn" @click="page = 'rules'">Вернуться назад</div>
                </div>
            </div>
        </div>
    </div>
</template>
<script>
import { mapGetters } from "vuex";
export default {
    data() {
        return {
            preparedTest: [],
            wrongAnswers: [],
            selectedCategory: "",
            isTestStart: false,
            page: "rules",
            allTest: [
                {
                    id: 1,
                    question: "Перед вами движется транспортное средство с наименьшей скоростью, ваши действия?",
                    answers: [
                        { id: 1, text: "моргнёте фарами, что бы водитель уступил вам дорогу" },
                        { id: 2, text: "включить поворот и обогнать транспортное средство" },
                        { id: 3, text: "убедиться в том, что обгон разрешен, вы никому не создаете помеху, включить левый поворот и опередив транспортное средство вернуться в ранее занимаемую полосу" },
                    ],
                    rightAnswer: 3,
                    selectedAnswer: false,
                },
                {
                    id: 2,
                    question: "Вас остановил сотрудник полиции, ваши действия:",
                    answers: [
                        { id: 1, text: "Начать возмущаться, почему сотрудник полиции вас остановил, ведь вы ничего не нарушили" },
                        { id: 2, text: "Предъявить по требованию сотрудников полиции водительское удостоверение" },
                        { id: 3, text: "Не обращая внимания на сотрудников полиции продолжить движение" },
                    ],
                    rightAnswer: 2,
                    selectedAnswer: false,
                },
                {
                    id: 3,
                    question: "Вы попали в дорожно транспортное происшествие, какими будут ваши действия.",
                    answers: [
                        { id: 1, text: "вы убедитесь, что никто не пострадал и продолжите движение дальше" },
                        { id: 2, text: "вы должны оставаться на месте происшествия до прибытия полиции и если есть пострадавшие вызвать медиков" },
                        { id: 3, text: "удостоверюсь, что моё транспортное средство в порядке и продолжу движение дальше" },
                    ],
                    rightAnswer: 2,
                    selectedAnswer: false,
                },
                {
                    id: 4,
                    question: "Водителю запрещается.",
                    answers: [
                        { id: 1, text: "управлять транспортным средством в состоянии опьянения (алкогольного, наркотического или иного)" },
                        { id: 2, text: "передавать управление транспортным средством лицам, находящимся в состоянии опьянения (алкогольного, наркотического или иного)" },
                        { id: 3, text: "пользоваться во время движения телефоном" },
                        { id: 4, text: "все утверждения верны." },
                    ],
                    rightAnswer: 4,
                    selectedAnswer: false,
                },
                {
                    id: 5,
                    question: "Ваши действия при приближение к вам автомобиля  с включенными проблесковым маячком красно-синего цвета и специальным звуковым сигналом?",
                    answers: [
                        { id: 1, text: "водитель должен снизить скорость, чтобы иметь возможность немедленно остановиться в случае необходимости." },
                        { id: 2, text: "уступить дорогу (сбросив скорость и прижавшись к правому краю полотна) для обеспечения беспрепятственного проезда указанного транспортного средства." },
                        { id: 3, text: "Продолжить движение не меняя скорости и полосы." },
                    ],
                    rightAnswer: 2,
                    selectedAnswer: false,
                },
                {
                    id: 6,
                    question: "Вы пересекаете дорогу по пешеходному переходу, ваши действия ?",
                    answers: [
                        { id: 1, text: "Убедиться в безопасности пересечения проезжей части посмотрев налево, а затем направо, и только потом перейти." },
                        { id: 2, text: "Осмотреться по сторонам направо, а затем налево." },
                        { id: 3, text: "Не глядя по сторонам перебежать дорогу." },
                    ],
                    rightAnswer: 1,
                    selectedAnswer: false,
                },
                {
                    id: 7,
                    question: "Где запрещен разворот транспортного средства ?",
                    answers: [{ id: 1, text: "на пешеходных переходах" }, { id: 2, text: "в тоннелях, на мостах, путепроводах, эстакадах и под ними" }, { id: 3, text: "на железнодорожных переездах" }, { id: 4, text: "в местах остановок маршрутных транспортных средств." }],
                    rightAnswer: [1, 2, 3, 4],
                    selectedAnswer: false,
                    multipleAnswer: true,
                },
                {
                    id: 8,
                    question: "При каких условиях разрешается езда задним ходом?",
                    answers: [
                        { id: 1, text: "этот маневр будет безопасен и не создаст помех другим участникам движения." },
                        { id: 2, text: "если случайно проехал нужный поворот" },
                        { id: 3, text: "при езде по дороге с односторонним движением" },
                        { id: 4, text: "все утверждения верны" },
                    ],
                    rightAnswer: 1,
                    selectedAnswer: false,
                    multipleAnswer: false,
                },
                {
                    id: 9,
                    question: "При каких ситуациях разрешено движение транспортных средств по разделительным полосам и обочинам, тротуарам и пешеходным дорожкам.",
                    answers: [{ id: 1, text: "eсли нужно срочно развернуться." }, { id: 2, text: "если нужно сократить дорогу." }, { id: 3, text: "навигатор проложил дорогу." }, { id: 4, text: "запрещено во всех случаях" }],
                    rightAnswer: 4,
                    selectedAnswer: false,
                },
                {
                    id: 10,
                    question: "С какой максимально допустимой скоростью можно двигаться в населенном пункте:",
                    answers: [{ id: 1, text: "50 км/ч" }, { id: 2, text: "60 км/ч" }, { id: 3, text: "90 км/ч" }, { id: 4, text: "110 км/ч" }],
                    rightAnswer: 2,
                    selectedAnswer: false,
                },
                {
                    id: 11,
                    question: "С какой максимально допустимой скоростью можно двигаться по автомагистрали:",
                    answers: [{ id: 1, text: "90 км/ч" }, { id: 2, text: "110 км/ч" }, { id: 3, text: "160 км/ч" }, { id: 4, text: "200 км/ч" }],
                    rightAnswer: 3,
                    selectedAnswer: false,
                },
                {
                    id: 12,
                    question: "С какой максимально допустимой скоростью можно двигаться в не населенном пункте",
                    answers: [{ id: 1, text: "60 км/ч" }, { id: 2, text: "90 км/ч" }, { id: 3, text: "110 км/ч" }, { id: 4, text: "160 км/ч" }],
                    rightAnswer: 2,
                    selectedAnswer: false,
                },
                {
                    id: 13,
                    question: "При движений по автомагистрали ваш автомобиль вышел из строя, какие будут ваши действия?",
                    answers: [
                        { id: 1, text: "Все утверждения верны." },
                        { id: 2, text: "Включите аварийную сигнализацию." },
                        { id: 3, text: "Высадите всех пассажиров на обочину подальше от движения." },
                        { id: 4, text: "Поднимите капот." },
                    ],
                    rightAnswer: 1,
                    selectedAnswer: false,
                },
                {
                    id: 14,
                    question: "Где разрешена остановка:",
                    answers: [{ id: 1, text: "красный бордюр" }, { id: 2, text: "белый бордюр" }, { id: 3, text: "желтый бордюр" }, { id: 4, text: "все варианты верны" }],
                    rightAnswer: [2, 3],
                    selectedAnswer: false,
                    multipleAnswer: true,
                },
                {
                    id: 15,
                    question: "Обязан ли водитель уступать дорогу пешеходу:",
                    answers: [{ id: 1, text: "Да" }, { id: 2, text: "Нет" }],
                    rightAnswer: 1,
                    selectedAnswer: false,
                },
                {
                    id: 16,
                    question: "Где запрещена остановка",
                    answers: [{ id: 1, text: "красный бордюр" }, { id: 2, text: "белый бордюр" }, { id: 3, text: "желтый бордюр" }, { id: 4, text: "все варианты верны" }],
                    rightAnswer: 1,
                    selectedAnswer: false,
                },
                {
                    id: 17,
                    question: "Двигаясь по проезжей части, вы видите отъезжающий от остановки автобус ваши действия?",
                    answers: [{ id: 1, text: "уступлю дорогу автобусу" }, { id: 2, text: "продолжу двигаться не сбавляя газу в том же направлений" }, { id: 3, text: "начну обгон по встречной полосе." }],
                    rightAnswer: 1,
                    selectedAnswer: false,
                },
                {
                    id: 18,
                    question: "имеет ли право водитель автопоезда передвигаться в населенном пункте:",
                    answers: [{ id: 1, text: "Да" }, { id: 2, text: "Нет" }],
                    rightAnswer: 1,
                    selectedAnswer: false,
                },
                {
                    id: 19,
                    question: "Имеет ли право водитель автопоезда выезжать на встречную полосу.",
                    answers: [{ id: 1, text: "при вынужденном маневре" }, { id: 2, text: "Да" }, { id: 3, text: "Нет" }],
                    rightAnswer: 1,
                    selectedAnswer: false,
                },
            ],
            driverCategory: [
                { title: "A", imgClass: "cat-A", description: "Для управления мотоциклами", price: 2000 },
                { title: "B", imgClass: "cat-B", description: "Для управления легковым транспортом", price: 4000 },
                { title: "C", imgClass: "cat-C", description: "Для управления грузовым транспортом без прицепов и транспортом инкассаторов", price: 14000 },
                { title: "D", imgClass: "cat-CE", description: "Для управления автобусом", price: 8000 },
                { title: "C+E", imgClass: "cat-D", description: "Для управления грузовым транспортом с прицепами", price: 18000 },
                { title: "L", imgClass: "cat-L", description: "Для управления воздушным транпортом", price: 30000, buy: true },
                { title: "V", imgClass: "cat-V", description: "Для управления водным транспортом", price: 10000, buy: true },
            ],
        };
    },
    computed: {
        ...mapGetters({
            license: "getPlayerLicense",
        }),
    },
    methods: {
        startTest: function(category, price, buy = false) {
            if (buy) {
                mp.trigger("cMisc-CallServerEvent", "sDrivingSchoolGetCategory", category, price);
                this.exit();
            } else {
                this.randomizeTest();
                this.selectedCategory = category;
                this.isTestStart = true;
                this.page = "test";
                mp.trigger("cMisc-CallServerEvent", "sDrivingSchoolStartTest", JSON.stringify({ category, price }));
            }
        },
        endTest: function() {
            this.wrongAnswers = [];
            for (let question of this.preparedTest) {
                if (!question.selectedAnswer) return storage.addNotification({ text: "Вы ответили не на все вопросы", theme: "error" });
            }
            this.preparedTest.forEach(question => {
                if (question.multipleAnswer) {
                    if (!arrayCompare(question.selectedAnswer, question.rightAnswer)) {
                        this.wrongAnswers.push(question.question);
                    }
                } else {
                    if (question.selectedAnswer != question.rightAnswer) {
                        this.wrongAnswers.push(question.question);
                    }
                }
            });
            if (this.wrongAnswers.length > 2) {
                this.page = "result-fail";
            } else {
                this.page = "result-success";
                mp.trigger("cMisc-CallServerEvent", "sDrivingSchoolTestPassed", this.selectedCategory);
            }
            this.isTestStart = false;
        },
        randomizeTest: function() {
            this.allTest.forEach(question => {
                if (question.multipleAnswer) {
                    question.selectedAnswer = [];
                } else {
                    question.selectedAnswer = false;
                }
            });
            this.preparedTest = this.allTest.slice();
            shuffleArray(this.preparedTest);
            this.preparedTest.splice(0, 2);
            this.preparedTest.forEach(question => {
                shuffleArray(question.answers);
            });
        },
        updateLicense: function(category, price) {
            const licenseId = this.license.find(l => l.title === category).id;
            mp.trigger("cMisc-CallServerEvent", "sDrivingSchoolUpdateLicense", JSON.stringify({ licenseId, price }));
            this.exit();
        },
        exit: function() {
            if (this.isTestStart) {
                storage.addNotification({ text: "Тест провален", theme: "error" });
                this.isTestStart = false;
            }
            mp.trigger("cSetPage", "none");
        },
        onKeyUp(e) {
            if (e.keyCode === 27) {
                this.exit();
            }
        },
    },
    created() {
        document.addEventListener("keyup", this.onKeyUp);
    },
    beforeDestroy() {
        document.removeEventListener("keyup", this.onKeyUp);
        this.selectedCategory = "";
        this.isTestStart = false;
        this.page = "rules";
    },
};
const arrayCompare = (a1, a2) => {
    a1 = a1.slice().sort();
    a2 = a2.slice().sort();
    return a1.length == a2.length && a1.every((v, i) => v === a2[i]);
};
const shuffleArray = array => {
    for (var i = array.length - 1; i > 0; i--) {
        var j = Math.floor(Math.random() * (i + 1));
        var temp = array[i];
        array[i] = array[j];
        array[j] = temp;
    }
};
</script>
<style lang="scss" scoped>
html, body, div, span, applet, object, iframe,
h1, h2, h3, h4, h5, h6, p, blockquote, pre,
a, abbr, acronym, address, big, cite, code,
del, dfn, em, img, ins, kbd, q, s, samp,
small, strike, strong, sub, sup, tt, var,
b, u, i, center,
dl, dt, dd, ol, ul, li,
fieldset, form, label, legend,
table, caption, tbody, tfoot, thead, tr, th, td,
article, aside, canvas, details, embed, 
figure, figcaption, footer, header, hgroup, 
menu, nav, output, ruby, section, summary,
time, mark, audio, video {
    margin: 0;
    padding: 0;
    border: 0;
    font-size: 100%;
    font: inherit;
    vertical-align: baseline;
}
* {
    padding: 0;
    margin: 0;
    outline: 0;
    text-decoration: none;
    -moz-box-sizing: border-box;
    box-sizing: border-box;
}
input::-webkit-outer-spin-button,
input::-webkit-inner-spin-button {
    -webkit-appearance: none;
}

.wrapper{
    width: 100%;
    height: 100vh;
}
    .screen{
        width: 100%;
        height: 100%;
        display: flex;
        justify-content: center;
        align-items: center;
    }
    .base{
        width: 50vw;
        height: 36vw;
        background: rgba(0, 41, 80, 0.9);
        border-radius: 0.52vw;
        overflow: hidden;
    }
    .header{
        display: flex;
        justify-content: center;
        align-items: center;
        height: 15%;
    }
    .result{
        .header{
            background: #1A8BE4;
        }
        .header-title{
            font-size: 3.13vw;
        }
        .content{
            height: 70%;
            display: flex;
            justify-content: center;
            align-items: center;
        }
        .text{
            font-family: "Century Gothic";
            font-size: 1.5vw;
            line-height: 2.13vw;
            text-align: center;
            width: 75%;
            /* padding: 2.6vw 2.08vw; */
            box-shadow: 0 0.21vw 0.21vw rgba(0, 0, 0, 0.25);
            color: #fff;
            border-radius: 0.52vw;
            &.success{
                background: rgba(28, 136, 18, 0.92);
            }
            &.fail{
                background: rgba(190, 30, 30, 0.801);
                margin-bottom: 1vw;
            }
        }
        .footer{
            display: flex;
            justify-content: center;
        }
    }
    .header-title{
        font-family: "Century Gothic";
        font-size: 1.88vw;
        text-align: center;
        color: #FFFFFF;
    }
    .footer{
        display: flex;
        justify-content: flex-end;
        align-items: center;
        height: 15%;
        .btn{
            padding: 0.26vw 1.56vw;
            background: rgb(26, 139, 228);
            box-shadow: 0 0.16vw 0.16vw rgba(0, 0, 0, 0.25);
            font-family: "Century Gothic";
            font-size: 1.56vw;
            color: #FFFFFF;
            transition: 0.15s;
            border-radius: 0.2vw;
            &:hover{
                background: darken(rgb(26, 139, 228), 10%);
            }
        }
    }
    .test{
        padding: 0 1.72vw;
        .content{
            max-height: 70%;
            overflow-y: auto;
            width: 100%;
            padding: 0 0.52vw;
            &::-webkit-scrollbar{
                width: 0.52vw;
            }
            &::-webkit-scrollbar-thumb{
                border-radius: 0.52vw;
                background: #FFFFFF;
            }
            &::-webkit-scrollbar-track{
                border-radius: 0.52vw;
                background: rgb(3, 49, 85);
            }
        }
    }
    .test-item{
        width: 100%;
        box-shadow: 0 0.21vw 0.21vw rgba(0, 0, 0, 0.25);
        border-radius: 0.52vw;
        overflow: hidden;
        margin-bottom: 1vw;
        .item-header{
            padding: 0.52vw 1.04vw;
            background: #1A8BE4;
            font-family: "Century Gothic";
            font-size: 1.25vw;
            line-height: 1.93vw;
            text-align: center;
            color: #FCF7F7;
        }
        .item-body{
            padding: 0.52vw 1.04vw;
            background: #045391;
        }
    }
    .answer-wrap{
        margin: 0.9vw 0;
    }
    .answer-wrap .container{
        display: flex;
        align-items: center;
    }
    .rules{
        padding: 0 1.72vw;
        .content-wrapper{
            height: 70%;
            width: 100%;
            margin: 0 auto;
            padding: 0 0.52vw;
            overflow-y: auto;
             &::-webkit-scrollbar{
                width: 0.52vw;
            }
            &::-webkit-scrollbar-thumb{
                border-radius: 0.52vw;
                background: #FFFFFF;
            }
            &::-webkit-scrollbar-track{
                border-radius: 0.52vw;
                background: rgb(3, 49, 85);
            }
        }
        .content{
            width: 100%;
            border-radius: 0.52vw;
            background: #045391;
            font-family: "Century Gothic";
            font-size: 0.94vw;
            line-height: 1.15vw;
            color: #FFF8F8;
            padding: 1.04vw;
            overflow: hidden;
            p{
                margin-bottom: 0.52vw;
            }
            b{
                font-weight: bold;
                margin-right: 0.26vw;
            }
           
        }
        
    }
    .row{
        display: flex;
        width: 100%;
        justify-content: center;
        &.m{
            padding: 0 6.875vw;
        }
    }
    .cards{
        padding: 2vw 2vw;
        width: 59vw;
        display: flex;
        flex-wrap: wrap;
        justify-content: space-evenly;
        .card{
            width: 11.6vw;
            height: 15vw;
            background: #045391;
            border-radius: 0.52vw;
            box-shadow: 0 0.21vw 0.21vw rgba(0, 0, 0, 0.25);
            padding: 0 2%;
        }
        .card-header{
            font-family: Gotham Pro;
            display: flex;
            justify-content: center;
            align-items: center;
            font-weight: bold;
            font-size: 1.21vw;
            line-height: 1.35vw;
            text-align: center;
            color: #FFFFFF;
            height: 20%;
        }
        .card-body{
            height: 60%;
            background-color: #0865AE;
            box-shadow: 0 0.16vw 0.26vw rgba(0, 0, 0, 0.1);
            border-radius: 0.52vw;
            background-position: center center;
            background-repeat: no-repeat;
            background-size: 50%;
            padding: 0 5%;
            &.cat-A{
                background-image: url('/img/driving-school/a.png');
            }
            &.cat-B{
                background-image: url('/img/driving-school/b.png');
            }
            &.cat-C{
                background-image: url('/img/driving-school/c.png');
            }
            &.cat-CE{
                background-image: url('/img/driving-school/c+e.png');
            }
            &.cat-D{
                background-image: url('/img/driving-school/d.png');
            }
            &.cat-L{
                background-image: url('/img/driving-school/l.png');
            }
            &.cat-V{
                background-image: url('/img/driving-school/v.png');
            }
        }
        .card-text{
            font-family: "Century Gothic";
            font-size: 0.94vw;
            line-height: 1.15vw;
            text-align: center;
            color: #FFFFFF;
            height: 80%;
            padding-top: 5%;
        }
        .card-price{
            font-family: "Gotham Pro";
            font-size: 1.25vw;
            line-height: 1.46vw;
            text-align: center;
            color: #FFFFFF;
            height: 20%;
        }
        .card-footer{
            height: 20%;
            display: flex;
            justify-content: center;
            align-items: center;
        }
        .card-btn{
            background: #1A8BE4;
            font-family: "Gotham Pro";
            border-radius: 0.52vw;
            font-size: 0.94vw;
            width: 100%;
            height: 1.93vw;
            line-height: 1.93vw;
            text-align: center;
            color: #FFFFFF;
            transition: 0.15s;
            &:hover{
                background: #FFFFFF;
                color: #15337B;
            }
        }
    }
[type="checkbox"]:checked,
[type="checkbox"]:not(:checked),
[type="radio"]:checked,
[type="radio"]:not(:checked) {
    position: absolute;
    left: -9999px;
}
[type="checkbox"]:checked + label,
[type="checkbox"]:not(:checked) + label,
[type="radio"]:checked + label,
[type="radio"]:not(:checked) + label
{
    position: relative;
    padding-left: 1.77vw;
    cursor: pointer;
    display: inline-block;
    font-size: 1.15vw;
    color: #FFFFFF;
    margin-left: 0.52vw;
    font-family: "Gotham Pro";
    display: flex;
    align-items: center;
}
[type="checkbox"]:checked + label:before,
[type="checkbox"]:not(:checked) + label:before,
[type="radio"]:checked + label:before,
[type="radio"]:not(:checked) + label:before {
    content: '';
    position: absolute;
    left: 0;
    // top: 0;
    width: 0.94vw;
    height: 0.94vw;
    border: 0.05vw solid #ddd;
    border-radius: 100%;
    background: #fff;
}
[type="checkbox"]:checked + label:after,
[type="checkbox"]:not(:checked) + label:after,
[type="radio"]:checked + label:after,
[type="radio"]:not(:checked) + label:after {
    content: '';
    width: 0.63vw;
    height: 0.63vw;
    background: #1A8BE4;
    position: absolute;
    // top: 4px;
    left: 0.21vw;
    border-radius: 100%;
    -webkit-transition: all 0.2s ease;
    transition: all 0.2s ease;
}
[type="checkbox"]:not(:checked) + label:after,
[type="radio"]:not(:checked) + label:after {
    opacity: 0;
    -webkit-transform: scale(0);
    transform: scale(0);
}
[type="checkbox"]:checked + label:after,
[type="radio"]:checked + label:after {
    opacity: 1;
    -webkit-transform: scale(1);
    transform: scale(1);
}
[type="checkbox"]:checked + label:after,
[type="checkbox"]:checked + label:before,
[type="checkbox"]:not(:checked) + label:after,
[type="checkbox"]:not(:checked) + label:before {
    border-radius: 0;
}
.content-fail {
    display: flex;
    flex-direction: column;
}
.mistakes {
    display: flex;
    flex-direction: column;
    align-items: center;
    overflow: auto;
    height: 14vw;
        .small {
            font-size: 1vw;
            line-height: 1.5vw;
            width: 60%
        }
}
::-webkit-scrollbar {
  width: 5px;
}
::-webkit-scrollbar-track {
  background-color: #737373;
}
::-webkit-scrollbar-thumb {
  background-color: #fff;
}
li {
    margin-left: 3vw;
}
.headline{
    text-align:center;
    font-weight: 600;
}
</style>